'use strict';

/*Task #1*
Оголосіть дві змінні: admin та name.*/
let admin;
let name;

//Запишіть рядок "John" у змінну назву.
name = 'John';

//Скопіюйте значення зі змінної name в admin.
admin = name;

//Виведіть на екран значення admin, використовуючи функцію alert.
alert(admin);


/*Task #1*
Створіть змінну назви нашої планети. Як ви її назвете? */
let planet='Earth';

/*Створіть змінну для зберігання імені відвідувача сайту.
Як би ви назвали таку змінну?*/
let userName = prompt('Enter your name');
alert('Hello, '+userName+'! How are you?');

/*Task #3*
1. Створити змінну і зберегти в ній значення 10 (рядок) + 10 (число),
перевірити її тип і вивести його в консоль, вивчити питання чому саме так все працює.*/

let someVar = '10'+10;
console.log(someVar);